// Задача 4. Дано послідовність номерів автомобілів. Підрахувати кількість номерів, які :
// •	починаються на букву «А»;
// •	перша і остання літери співпадають;
// •	складаються з більше ніш 5 символів;
if (confirm('start')) {
    const carNumbers = [
        "АВ1234СЕ",  // ✅ Починається на "А"
        "АХ5678А",   // ✅ Починається на "А" і перша та остання літери збігаються
        "ОР4321ТР",  // ✅ Довжина > 5
        "АХ9876КО",  // ✅ Починається на "А"
        "МН3456МН",  // ✅ Перша і остання літери співпадають
        "СЕ6543ОР",  // ✅ Довжина > 5
        "ВТ1111АВ",  // ✅ Довжина > 5
        "А12345А",   // ✅ Починається на "А", перша та остання літери співпадають і довжина > 5
        "ТР3333МН",  // ✅ Довжина > 5
        "КЕ4444СЕ",  // ✅ Довжина > 5
        "АВ55555",   // ✅ Починається на "А", довжина > 5
        "СЕ6666ТР",  // ✅ Довжина > 5
        "МН77777МН", // ✅ Перша і остання літери збігаються, довжина > 5
        "АХdd8f",   // ✅ Починається на "А", довжина > 5
        "А999999А"   // ✅ Починається на "А", довжина > 5, перша і остання літера збігаються
    ]
    // за генерацію дякую ші, далі сам
    let a = 0
    let firstAndEndLetersToMatch = 0
    let more5Symbols = 0
    for (let num = 0; num < carNumbers.length; num++) {
        if(carNumbers[num][0] === 'А') a++
        if(carNumbers[num][0] === carNumbers[num][carNumbers[num].length-1]) firstAndEndLetersToMatch++
        if(carNumbers[num].length > 5) more5Symbols++
    }
    document.write(`Починаються на А: ${a}`)
    document.write(`співпадає перша і остання літера: ${firstAndEndLetersToMatch}`)
    document.write(`Більше 5-ти символів: ${more5Symbols}`)
}


