// З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий автомобіль, С-вантажний автомобіль). Вивести на екран назву транспортного засобу, яким він може керувати.
let NameCategory = prompt('введи свою категорію водія4', '')
switch (NameCategory) {
    case 'A':
    case 'a': alert('В тебе категорія А - мотоцикл')
        
        break;
    case 'B':
    case 'b': alert('В тебе категорія B - легкове авто')
        break
    case 'C':
    case 'c': alert('В тебе категорія C - вантажне авто')
        break
        default: alert('такої категорії ми не знаємо')
        break;
}

